source/InformationRegisters/VKRSourceStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRSourceStates</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Payload</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Revision</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Cancelled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/InformationRegisters/VKRNotificationKeys.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRNotificationKeys</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Revision</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/InformationRegisters/VKRQueue.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRQueue</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Event</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>State</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Attempts</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>NextTry</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClaimUntil</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastError</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/InformationRegisters/VKRAttempts.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>VKRAttempts</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Notification</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.OtpravkaUvedomleniya</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Started</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Finished</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Outcome</Name>
					<Type>
						<v8:Type>cfg:EnumRef.VKRQueueStates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ErrorText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AttemptID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

source/AccumulationRegisters/OtpravlennyeUvedomleniya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>OtpravlennyeUvedomleniya</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Kolichestvo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemaPisma</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DokumentOsnovanie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Poluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

source/AccumulationRegisters/OshibkiOtpravkiUvedomleniy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>OshibkiOtpravkiUvedomleniy</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Kolichestvo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>OpisanieOshibki</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DokumentOsnovanie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Poluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VidIzmeneniya</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Podrazdelenie</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

source/Enums/StatusyUvedomleniy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>StatusyUvedomleniy</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Podgotovleno</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Otpravleno</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Oshibka</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PovtornoOtpravleno</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Otmeneno</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/Enums/VKRQueueStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>VKRQueueStates</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Prepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Retry</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Failed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Unknown</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Cancelled</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

source/Documents/OtpravkaUvedomleniya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>OtpravkaUvedomleniya</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.OtpravlennyeUvedomleniya</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>KadrovoyeIzmenenie</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.KadrovoyeIzmenenie</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Sotrudnik</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Sotrudniki</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Poluchatel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PoluchateliUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TemaPisma</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TekstPisma</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.StatusyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataOtpravki</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Kommentariy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRRule</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.PravilaRassylki</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRTemplate</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ShablonyPisem</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRRevision</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRSourceSnapshot</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRChangeType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.VidyKadrovykhIzmeneniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Podrazdeleniya</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRSMTPProfile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SMTPServery</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRChannel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KanalyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VKRNotificationType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.TipyUvedomleniy</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

source/CommonModules/VKROutbox/Ext/Module.bsl
// Очередь и история попыток. Все имена новых метаданных перечислены в manifest.
// Подготовка вызывается в транзакции проведения. Сеть вызывается вне транзакции.

Процедура Заблокировать(ИмяРегистра, Поле, Значение) Экспорт
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить("РегистрСведений." + ИмяРегистра);
    Элемент.УстановитьЗначение(Поле, Значение);
    Блокировка.Заблокировать();
КонецПроцедуры

Функция СнимокСобытия(Документ) Экспорт
    Д = Новый Структура;
    Д.Вставить("Employee", Документ.Sotrudnik);
    Д.Вставить("Kind", Документ.VidIzmeneniya);
    Д.Вставить("Reason", Документ.VKRReason);
    Д.Вставить("SourceKind", Документ.VKRSourceKind);
    Д.Вставить("Date", Документ.DataIzmeneniya);
    Д.Вставить("DepartmentBefore", Документ.PodrazdelenieDo);
    Д.Вставить("DepartmentAfter", Документ.PodrazdeleniePosle);
    Д.Вставить("PositionBefore", Документ.DolzhnostDo);
    Д.Вставить("PositionAfter", Документ.DolzhnostPosle);
    Д.Вставить("SalaryBefore", Документ.OkladDo);
    Д.Вставить("SalaryAfter", Документ.OkladPosle);
    Д.Вставить("Notify", Документ.TrebuyetsyaUvedomleniye);
    Д.Вставить("Manual", Документ.VKRManualRecipients);
    Если Документ.VKRManualRecipients Тогда
        Адресаты = Новый ТаблицаЗначений;
        Адресаты.Колонки.Добавить("Ref");
        Адресаты.Колонки.Добавить("Email");
        Для Каждого Строка Из Документ.Poluchateli Цикл
            Новая = Адресаты.Добавить();
            Новая.Ref = Строка.Poluchatel;
            Новая.Email = СокрЛП(Строка.Email);
        КонецЦикла;
        Адресаты.Сортировать("Email");
        Д.Вставить("Recipients", Адресаты);
    КонецЕсли;
    // Полное внутреннее представление исключает неоднозначную склейку полей.
    Возврат ЗначениеВСтрокуВнутр(Д);
КонецФункции

Процедура Подготовить(Документ) Экспорт
    Если НЕ ТранзакцияАктивна() Тогда
        ВызватьИсключение "Подготовка очереди должна выполняться в транзакции записи события.";
    КонецЕсли;
    Заблокировать("VKRSourceStates", "Event", Документ.Ссылка);
    Состояние = РегистрыСведений.VKRSourceStates.СоздатьМенеджерЗаписи();
    Состояние.Event = Документ.Ссылка;
    Состояние.Прочитать();
    Снимок = СнимокСобытия(Документ);
    Если Состояние.Выбран() И Состояние.Payload = Снимок И НЕ Состояние.Cancelled Тогда
        // Повтор без изменения события не создаёт новую ревизию и новые письма.
        Возврат;
    КонецЕсли;
    Ревизия = ?(Состояние.Выбран(), Состояние.Revision + 1, 1);
    Письма = Неопределено;
    Если Документ.TrebuyetsyaUvedomleniye Тогда
        Письма = VKRRules.ПодготовитьПисьма(Документ);
    КонецЕсли;
    ОтменитьОжидающие(Документ.Ссылка);
    Если Письма <> Неопределено Тогда
        Для Каждого Адресат Из Письма.Адресаты Цикл
            СоздатьЗадание(Документ, Ревизия, Снимок, Письма, Адресат);
        КонецЦикла;
    КонецЕсли;
    Состояние.Event = Документ.Ссылка;
    Состояние.Payload = Снимок;
    Состояние.Revision = Ревизия;
    Состояние.Cancelled = Ложь;
    Состояние.Записать();
КонецПроцедуры

Процедура СоздатьЗадание(Документ, Ревизия, Снимок, Письма, Адресат)
    Связь = РегистрыСведений.VKRNotificationKeys.СоздатьМенеджерЗаписи();
    Связь.Event = Документ.Ссылка;
    Связь.Revision = Ревизия;
    Связь.Email = Адресат.Email;
    Связь.Прочитать();
    Если Связь.Выбран() Тогда
        Возврат;
    КонецЕсли;
    Уведомление = Документы.OtpravkaUvedomleniya.СоздатьДокумент();
    Уведомление.Дата = ТекущаяДатаСеанса();
    Уведомление.Status = Перечисления.StatusyUvedomleniy.Podgotovleno;
    Уведомление.KadrovoyeIzmenenie = Документ.Ссылка;
    Уведомление.Sotrudnik = Документ.Sotrudnik;
    Уведомление.Poluchatel = Адресат.Получатель;
    Уведомление.Email = Адресат.Email;
    Уведомление.TemaPisma = Письма.Тема;
    Уведомление.TekstPisma = Письма.Текст;
    Уведомление.VKRRule = Письма.Правило;
    Уведомление.VKRSMTPProfile = Письма.Профиль;
    Уведомление.VKRChannel = Письма.Канал;
    Уведомление.VKRNotificationType = Письма.Назначение;
    Уведомление.VKRTemplate = Письма.Шаблон;
    Уведомление.VKRRevision = Ревизия;
    Уведомление.VKRSourceSnapshot = Снимок;
    Уведомление.VKRChangeType = Документ.VidIzmeneniya;
    Уведомление.VKRDepartment = ?(ЗначениеЗаполнено(Документ.PodrazdeleniePosle),
        Документ.PodrazdeleniePosle, Документ.PodrazdelenieDo);
    Уведомление.ДополнительныеСвойства.Вставить("VKRServiceWrite", Истина);
    Уведомление.Записать();
    Связь.Event = Документ.Ссылка;
    Связь.Revision = Ревизия;
    Связь.Email = Адресат.Email;
    Связь.Notification = Уведомление.Ссылка;
    Связь.Записать();
    Очередь = РегистрыСведений.VKRQueue.СоздатьМенеджерЗаписи();
    Очередь.Notification = Уведомление.Ссылка;
    Очередь.Event = Документ.Ссылка;
    Очередь.State = Перечисления.VKRQueueStates.Prepared;
    Очередь.Attempts = 0;
    Очередь.NextTry = ТекущаяДатаСеанса();
    Очередь.Записать();
КонецПроцедуры

Процедура ОтменитьОжидающие(Событие) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ О.Notification КАК Уведомление
        |ИЗ РегистрСведений.VKRQueue КАК О ГДЕ О.Event = &Событие";
    Запрос.УстановитьПараметр("Событие", Событие);
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Заблокировать("VKRQueue", "Notification", Выборка.Уведомление);
        О = ПрочитатьОчередь(Выборка.Уведомление);
        Если О.State = Перечисления.VKRQueueStates.Sending
            Или О.State = Перечисления.VKRQueueStates.Unknown Тогда
            ВызватьИсключение "Сначала завершите или разберите незавершённую отправку этого события.";
        КонецЕсли;
        Если О.State <> Перечисления.VKRQueueStates.Sent Тогда
            О.State = Перечисления.VKRQueueStates.Cancelled;
            О.Записать();
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

Процедура ОтменитьСобытие(Событие) Экспорт
    Если НЕ ТранзакцияАктивна() Тогда
        ВызватьИсключение "Отмена события должна выполняться в транзакции.";
    КонецЕсли;
    Заблокировать("VKRSourceStates", "Event", Событие);
    ОтменитьОжидающие(Событие);
    Запись = РегистрыСведений.VKRSourceStates.СоздатьМенеджерЗаписи();
    Запись.Event = Событие;
    Запись.Прочитать();
    Если Запись.Выбран() Тогда
        Запись.Cancelled = Истина;
        Запись.Записать();
    КонецЕсли;
КонецПроцедуры

Функция ПрочитатьОчередь(Уведомление)
    О = РегистрыСведений.VKRQueue.СоздатьМенеджерЗаписи();
    О.Notification = Уведомление;
    О.Прочитать();
    Если НЕ О.Выбран() Тогда
        ВызватьИсключение "Задание отсутствует в очереди.";
    КонецЕсли;
    Возврат О;
КонецФункции

Функция ПределПопыток() Экспорт
    Возврат Макс(1, Мин(3, Константы.VKRMaxAttempts.Получить()));
КонецФункции

Процедура ОбработатьОчередь() Экспорт
    Если ТранзакцияАктивна() Тогда
        ВызватьИсключение "Отправку нельзя запускать внутри транзакции.";
    КонецЕсли;
    ВосстановитьНезавершенные();
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5 О.Notification КАК Уведомление
        |ИЗ РегистрСведений.VKRQueue КАК О
        |ГДЕ О.State В (&Подготовлено, &Повтор)
        |И О.NextTry <= &Сейчас И О.Attempts < &Предел
        |УПОРЯДОЧИТЬ ПО О.NextTry, О.Notification";
    Запрос.УстановитьПараметр("Подготовлено", Перечисления.VKRQueueStates.Prepared);
    Запрос.УстановитьПараметр("Повтор", Перечисления.VKRQueueStates.Retry);
    Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
    Запрос.УстановитьПараметр("Предел", ПределПопыток());
    Задания = Запрос.Выполнить().Выгрузить();
    Для Каждого Строка Из Задания Цикл
        Попытка
            Токен = Захватить(Строка.Уведомление);
            Если ПустаяСтрока(Токен) Тогда
                Продолжить;
            КонецЕсли;
            Уведомление = Строка.Уведомление.ПолучитьОбъект();
            Результат = VKRMail.Отправить(Уведомление);
            Завершить(Строка.Уведомление, Токен, Результат);
        Исключение
            // Незавершённая попытка будет обнаружена по сроку захвата.
            ЗаписьЖурналаРегистрации("VKR.Очередь", УровеньЖурналаРегистрации.Ошибка,
                , Строка.Уведомление, ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры

Функция Захватить(Уведомление)
    Токен = "";
    НачатьТранзакцию();
    Попытка
        Заблокировать("VKRQueue", "Notification", Уведомление);
        О = ПрочитатьОчередь(Уведомление);
        Готово = (О.State = Перечисления.VKRQueueStates.Prepared
            Или О.State = Перечисления.VKRQueueStates.Retry)
            И О.NextTry <= ТекущаяДатаСеанса() И О.Attempts < ПределПопыток();
        Если Готово Тогда
            Если О.Event.ПометкаУдаления Или НЕ О.Event.Проведен Тогда
                О.State = Перечисления.VKRQueueStates.Cancelled;
                О.Записать();
            Иначе
                Токен = Строка(Новый УникальныйИдентификатор);
                О.State = Перечисления.VKRQueueStates.Sending;
                О.ClaimToken = Токен;
                О.ClaimUntil = ТекущаяДатаСеанса() + 300;
                О.Attempts = О.Attempts + 1;
                О.Записать();
                П = РегистрыСведений.VKRAttempts.СоздатьМенеджерЗаписи();
                П.AttemptID = Токен;
                П.Notification = Уведомление;
                П.Started = ТекущаяДатаСеанса();
                П.Outcome = Перечисления.VKRQueueStates.Sending;
                П.Записать();
            КонецЕсли;
        КонецЕсли;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
    Возврат Токен;
КонецФункции

Процедура Завершить(Уведомление, Токен, Результат)
    НачатьТранзакцию();
    Попытка
        Заблокировать("VKRQueue", "Notification", Уведомление);
        О = ПрочитатьОчередь(Уведомление);
        Если О.State <> Перечисления.VKRQueueStates.Sending Или О.ClaimToken <> Токен Тогда
            ВызватьИсключение "Попытка больше не владеет заданием.";
        КонецЕсли;
        О.State = Результат.Состояние;
        О.LastError = Лев(Результат.Ошибка, 1000);
        Если О.State = Перечисления.VKRQueueStates.Retry Тогда
            Если О.Attempts >= ПределПопыток() Тогда
                О.State = Перечисления.VKRQueueStates.Failed;
            Иначе
                Интервал = Макс(10, Константы.VKRRetrySeconds.Получить());
                О.NextTry = ТекущаяДатаСеанса() + Интервал * О.Attempts;
            КонецЕсли;
        КонецЕсли;
        О.ClaimToken = "";
        О.ClaimUntil = Дата(1, 1, 1);
        О.Записать();
        П = РегистрыСведений.VKRAttempts.СоздатьМенеджерЗаписи();
        П.AttemptID = Токен;
        П.Прочитать();
        Если НЕ П.Выбран() Тогда
            ВызватьИсключение "Не найдена начатая попытка отправки.";
        КонецЕсли;
        П.Finished = ТекущаяДатаСеанса();
        П.Outcome = О.State;
        П.ErrorText = О.LastError;
        П.Записать();
        ЗаписатьФакт(Уведомление, Токен, О.State, О.LastError);
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

Процедура ЗаписатьФакт(Ссылка, Токен, Состояние, Ошибка)
    У = Ссылка.ПолучитьОбъект();
    Если Состояние = Перечисления.VKRQueueStates.Sent Тогда
        У.Status = Перечисления.StatusyUvedomleniy.Otpravleno;
        У.DataOtpravki = ТекущаяДатаСеанса();
        У.ДополнительныеСвойства.Вставить("VKRServiceWrite", Истина);
        У.Записать();
        Набор = РегистрыНакопления.OtpravlennyeUvedomleniya.СоздатьНаборЗаписей();
        Набор.Отбор.Регистратор.Установить(Ссылка);
        Д = Набор.Добавить();
        Д.Активность = Истина;
        Д.Период = У.DataOtpravki;
        Д.Sotrudnik = У.Sotrudnik;
        Д.VidIzmeneniya = У.VKRChangeType;
        Д.Poluchatel = У.Poluchatel;
        Д.Status = У.Status;
        Д.Email = У.Email;
        Д.TemaPisma = У.TemaPisma;
        Д.DokumentOsnovanie = У.KadrovoyeIzmenenie;
        Д.Podrazdelenie = У.VKRDepartment;
        Д.Kolichestvo = 1;
        Набор.Записать();
    Иначе
        У.Status = Перечисления.StatusyUvedomleniy.Oshibka;
        У.ДополнительныеСвойства.Вставить("VKRServiceWrite", Истина);
        У.Записать();
        ДокОшибка = Документы.RegistratsiyaOshibkiOtpravki.СоздатьДокумент();
        ДокОшибка.Дата = ТекущаяДатаСеанса();
        ДокОшибка.KadrovoyeIzmenenie = У.KadrovoyeIzmenenie;
        ДокОшибка.Poluchatel = У.Poluchatel;
        ДокОшибка.Email = У.Email;
        ДокОшибка.OpisanieOshibki = Лев(Ошибка, 1000);
        ДокОшибка.DataOshibki = ДокОшибка.Дата;
        ДокОшибка.ДополнительныеСвойства.Вставить("VKRServiceWrite", Истина);
        ДокОшибка.VKRNotification = Ссылка;
        ДокОшибка.VKRAttemptID = Токен;
        ДокОшибка.VKRDescription = Лев(Ошибка, 1000);
        ДокОшибка.Записать();
        Набор = РегистрыНакопления.OshibkiOtpravkiUvedomleniy.СоздатьНаборЗаписей();
        Набор.Отбор.Регистратор.Установить(ДокОшибка.Ссылка);
        Д = Набор.Добавить();
        Д.Активность = Истина;
        Д.Период = ДокОшибка.Дата;
        Д.Poluchatel = У.Poluchatel;
        Д.VidIzmeneniya = У.VKRChangeType;
        Д.OpisanieOshibki = Лев(Ошибка, 1000);
        Д.DokumentOsnovanie = У.KadrovoyeIzmenenie;
        Д.Podrazdelenie = У.VKRDepartment;
        Д.Kolichestvo = 1;
        Набор.Записать();
    КонецЕсли;
КонецПроцедуры

Процедура ВосстановитьНезавершенные()
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ О.Notification КАК Уведомление, О.ClaimToken КАК Токен
        |ИЗ РегистрСведений.VKRQueue КАК О
        |ГДЕ О.State = &Отправка И О.ClaimUntil < &Сейчас";
    Запрос.УстановитьПараметр("Отправка", Перечисления.VKRQueueStates.Sending);
    Запрос.УстановитьПараметр("Сейчас", ТекущаяДатаСеанса());
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Р = Новый Структура("Состояние,Ошибка", Перечисления.VKRQueueStates.Unknown,
            "Истёк срок захвата. Проверить наличие письма в приёмнике до повторной отправки.");
        Попытка
            Завершить(Выборка.Уведомление, Выборка.Токен, Р);
        Исключение
            ЗаписьЖурналаРегистрации("VKR.Восстановление", УровеньЖурналаРегистрации.Ошибка,
                , Выборка.Уведомление, ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
КонецПроцедуры
